src/InformationRegisters/ИсторияВыполненияHTTPЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВыполненияHTTPЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ИнтернетСервисы/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ИспользоватьИнтернетСервисы() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьИнтернетСервисы");
	
КонецФункции

Функция ОтветИнтернетСервисыОтключены() Экспорт
	Возврат ПолучитьОтвет500(НСтр("ru='Интернет-сервисы отключены.'"));
КонецФункции

// Формирует объект HTTPЗапрос согласно настройкам
//
// Параметры:
//	НастройкиОбмена	- Структура - см. ИнтернетСервисыПереопределяемый.ПолучитьНастройкиПодключения
//	АдресРесурса	- Строка - адрес ресурса запроса без учета адреса сервера (/ не обязателен в конце)
//		Например: /hs/partners/
//	Параметры			- Структура - параметры для формирования строки параметров ?key=value[&key1=value1]
//		Ключ 		- Строка - имя параметра
//		Значение	- Строка - значение параметра
//	Заголовки		- Соответствие - значения заголовков для подстановки в запрос
//
// Возвращаемое значение:
//	HTTPЗапрос
//
Функция ПолучитьHTTPЗапрос(знач НастройкиОбмена, знач АдресРесурса, знач Параметры = Неопределено, знач Заголовки = Неопределено) Экспорт
	ПутьНаСервере = НастройкиОбмена.СтруктураАдреса.ПутьНаСервере;
	
	ЕстьРазделительПути 	= СтрЗаканчиваетсяНа(ПутьНаСервере, "/");
	ЕстьРазделительАдреса	= СтрНачинаетсяС(АдресРесурса, "/");
	
	Если ЕстьРазделительПути И ЕстьРазделительАдреса Тогда
		ПолныйАдресРесурса = ПутьНаСервере + Сред(АдресРесурса, 2);
	ИначеЕсли НЕ ЕстьРазделительПути И НЕ ЕстьРазделительАдреса Тогда
		ПолныйАдресРесурса = ПутьНаСервере + "/" + АдресРесурса;
	Иначе
		ПолныйАдресРесурса = ПутьНаСервере + АдресРесурса;
	КонецЕсли;
	
	Возврат ИнтернетСервисыКлиентСервер.ПолучитьHTTPЗапрос(ПолныйАдресРесурса, Параметры, Заголовки);
КонецФункции

// Формирует объект HTTPСоединение согласно настройкам
//
// Параметры:
//	НастройкиОбмена		- Структура - см. ИнтернетСервисыПереопределяемый.ПолучитьНастройкиПодключения
//	ПарольПользователя	- Строка - значение пароля для подключения, если не задано берется из настроек обмена
//
// Возвращаемое значение:
//	HTTPСоединение
//
Функция ПолучитьHTTPСоединение(знач НастройкиОбмена, знач ПарольПользователя = Неопределено) Экспорт
	Если ПарольПользователя = Неопределено Тогда
		ПарольПользователя = НастройкиОбмена.Пароль;
	КонецЕсли;
	
	Возврат ИнтернетСервисыКлиентСервер.ПолучитьHTTPСоединение(НастройкиОбмена.СтруктураАдреса, НастройкиОбмена.Пользователь, ПарольПользователя, Ложь, 0);
КонецФункции

#КонецОбласти

#Область ЛогированиеЗапросов

// Формирует структуру для записи в лог
//
// Параметры:
//	Запрос - HTTPСервисЗапрос
//
// Возвращаемое значение:
//   Структура
//		Начало		- Число
//		Метод		- Строка
//		Ресурс		- Строка
//		Параметры	- Строка
// 
Функция НачатьВыполнениеЗапроса(знач Запрос) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Начало"		, ТекущаяУниверсальнаяДатаВМиллисекундах());
	Структура.Вставить("Метод"		, Запрос.HTTPМетод);
	Структура.Вставить("Ресурс"		, Запрос.БазовыйURL + Запрос.ОтносительныйURL);
	Структура.Вставить("Параметры"	, Запрос.ПараметрыЗапроса);
	Возврат Структура;
КонецФункции

// Записывает данные в лог в фоновом режиме
//
// Параметры:
//	Начало		- Число
//	Метод		- Строка
//	Ресурс		- Строка
//	Параметры	- Строка
// 
Процедура ЗавершитьВыполнениеЗапроса(знач Структура) Экспорт
	Структура.Вставить("Конец", ТекущаяУниверсальнаяДатаВМиллисекундах());
	РегистрыСведений.ИсторияВыполненияHTTPЗапросов.ЗарегистрироватьСобытие(Структура);
КонецПроцедуры

// Выполняет запись в регистр сведений ИсторияВыполненияHTTPЗапросов
//
// Параметры:
//	Начало		- Число
//	Конец		- Число
//	Метод		- Строка
//	Ресурс		- Строка
//	Параметры	- Строка
// 
Процедура ДобавитьЗаписьИсторииИнтернетСервиса(СтруктураДанных) Экспорт
	ИмяРесурса = СтруктураДанных.Ресурс;
	Разделитель	= Найти(ИмяРесурса, "/hs/");
	Если Разделитель > 0 Тогда
		ИмяРесурса = Сред(ИмяРесурса, Разделитель + 4);
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("КлючСтроки"			, Строка(Новый УникальныйИдентификатор));
	ЗначенияЗаполнения.Вставить("Метод"					, СтруктураДанных.Метод);
	ЗначенияЗаполнения.Вставить("Ресурс"				, ИмяРесурса);
	ЗначенияЗаполнения.Вставить("Параметры"				, "");
	ЗначенияЗаполнения.Вставить("ВремяВыполнения"		, Формат(СтруктураДанных.Конец - СтруктураДанных.Начало, "ЧГ="));
	ЗначенияЗаполнения.Вставить("Пользователь"			, Пользователи.ТекущийПользователь());
	ЗначенияЗаполнения.Вставить("ИдентификаторСессии"	, "");
	ЗначенияЗаполнения.Вставить("ДатаОбращения"			, ТекущаяДатаСеанса());
	
	ДанныеПараметры = Неопределено;
	Если СтруктураДанных.Свойство("Параметры", ДанныеПараметры) Тогда
		Если ТипЗнч(ДанныеПараметры) = Тип("ФиксированноеСоответствие") Тогда
			Для Каждого КлючИЗначение Из ДанныеПараметры Цикл
				ЗначенияЗаполнения.Параметры = ЗначенияЗаполнения.Параметры + 
					?(ПустаяСтрока(ЗначенияЗаполнения.Параметры), "", "&") + 
					КлючИЗначение.Ключ + "=" + КлючИЗначение.Значение;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДанныеПараметры) = Тип("Строка") Тогда
			ЗначенияЗаполнения.Параметры = ДанныеПараметры;
		КонецЕсли;
	КонецЕсли;	
	
	ЗаписьРегистра = РегистрыСведений.ИсторияВыполненияHTTPЗапросов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ЗначенияЗаполнения);
	ЗаписьРегистра.Записать(Истина);
КонецПроцедуры

#КонецОбласти 

#Область ЖурналРегистрации

// Добавляет запись в журнал регистрации в группу "Интернет сервисы"
//
// Параметры:
//	ИмяЧасти			- Строка - доп. имя для события 
//	Комментарий			- Строка - комментарий
//	ОбъектМетаданных	- ЛюбаяСсылка - ссылка на объект
//	Данные				- ОбъектМетаданных
// 
Процедура ЗаписатьОшибкуВЖурналРегистрации(знач ИмяЧасти, знач Комментарий, знач ОбъектМетаданных = Неопределено, знач Данные = Неопределено) Экспорт
	ЗаписьЖурналаРегистрации(НСтр("ru='Интернет сервисы.'") + ИмяЧасти,
		УровеньЖурналаРегистрации.Ошибка,
		ОбъектМетаданных,
		Данные,
		Комментарий); 
КонецПроцедуры

#КонецОбласти 

#Область HTTPОтветы

// 200 Success - запрос выполнен успешно
Функция ПолучитьОтвет200(знач Заголовки = Неопределено, знач Тело = "", знач ТипТела = 0, знач Параметры = Неопределено) Экспорт
	Если ТипЗнч(Заголовки) <> Тип("Соответствие") Тогда
		Заголовки = Новый Соответствие;
		Если НЕ ПустаяСтрока(Тело) Тогда
			Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Если ТипТела = 0 И НЕ Параметры.Свойство("Кодировка") Тогда
		Параметры.Вставить("Кодировка", КодировкаТекста.UTF8);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200,, Заголовки);
	
	Если ТипТела = 0 Тогда
		Ответ.УстановитьТелоИзСтроки(Тело, Параметры.Кодировка);
	ИначеЕсли ТипТела = 1 Тогда
		Ответ.УстановитьТелоИзДвоичныхДанных(Тело);
	ИначеЕсли ТипТела = 2 Тогда
		Ответ.УстановитьИмяФайлаТела(Тело);
	КонецЕсли;
	
	ДополнитьОтветПараметрамиCORS(Ответ);
	Возврат Ответ;
КонецФункции

// 400 Bad Request — сервер обнаружил в запросе клиента синтаксическую ошибку.
Функция ПолучитьОтвет400(ТекстОшибки, Отказ = Ложь) Экспорт
	Отказ = Истина;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	СтруктураОшибки = ИнтернетСервисыКлиентСервер.СтруктураError(ТекстОшибки);
	СтруктураОшибки.Вставить("code", 400);
	
	Ответ = Новый HTTPСервисОтвет(400,, Заголовки);
	Ответ.УстановитьТелоИзСтроки(ИнтернетСервисы.ПолучитьСтрокуJSON(СтруктураОшибки));
	
	ДополнитьОтветПараметрамиCORS(Ответ);
	Возврат Ответ;
КонецФункции

// 401 Unauthorized — для доступа к запрашиваемому ресурсу требуется аутентификация.
Функция ПолучитьОтвет401(ТекстОшибки, Отказ = Ложь) Экспорт
	Отказ = Истина;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	СтруктураОшибки = ИнтернетСервисыКлиентСервер.СтруктураError(ТекстОшибки);
	СтруктураОшибки.Вставить("code", 401);
	
	Ответ = Новый HTTPСервисОтвет(401,, Заголовки);
	Ответ.УстановитьТелоИзСтроки(ИнтернетСервисы.ПолучитьСтрокуJSON(СтруктураОшибки));
	
	ДополнитьОтветПараметрамиCORS(Ответ);
	Возврат Ответ;
КонецФункции

// 403 Forbidden — сервер понял запрос, но он отказывается его выполнять из-за
// ограничений в доступе для клиента к указанному ресурсу. Если для доступа к ресурсу
// требуется аутентификация средствами HTTP, то следует возвращать ответ 401 или 407
// при использовании прокси. В любом случае клиенту следует сообщить причины отказа в
// обработке запроса.
Функция ПолучитьОтвет403(ТекстОшибки, Отказ = Ложь) Экспорт
	Отказ = Истина;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	СтруктураОшибки = ИнтернетСервисыКлиентСервер.СтруктураError(ТекстОшибки);
	СтруктураОшибки.Вставить("code", 403);
	
	Ответ = Новый HTTPСервисОтвет(403,, Заголовки);
	Ответ.УстановитьТелоИзСтроки(ИнтернетСервисы.ПолучитьСтрокуJSON(СтруктураОшибки));
	
	ДополнитьОтветПараметрамиCORS(Ответ);
	Возврат Ответ;
КонецФункции

// 404 Not Found — самая распространенная ошибка при пользовании Интернетом, основная
// причина — ошибка в написании адреса Web-страницы. Сервер понял запрос, но не нашёл
// соответствующего ресурса по указанному URI. Если серверу известно, что по этому адресу
// был документ, то ему желательно использовать код 410. Ответ 404 может использоваться
// вместо 403, если требуется тщательно скрыть от посторонних глаз определённые ресурсы.
Функция ПолучитьОтвет404(Отказ = Ложь) Экспорт
	Отказ = Истина;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	СтруктураОшибки = ИнтернетСервисыКлиентСервер.СтруктураError("");
	СтруктураОшибки.Вставить("code", 404);
	
	Ответ = Новый HTTPСервисОтвет(404,, Заголовки);
	Ответ.УстановитьТелоИзСтроки(ИнтернетСервисы.ПолучитьСтрокуJSON(СтруктураОшибки));
	
	ДополнитьОтветПараметрамиCORS(Ответ);
	Возврат Ответ;
КонецФункции

// 405 Method Not Allowed — указанный клиентом метод нельзя применить к текущему ресурсу.
// В ответе сервер должен указать доступные методы в заголовке Allow, разделив их запятой.
// Эту ошибку сервер должен возвращать, если метод ему известен, но он не применим именно
// к указанному в запросе ресурсу, если же указанный метод не применим на всём сервере,
// то клиенту нужно вернуть код 501 (Not Implemented).
Функция ПолучитьОтвет405(ДопустимыеМетоды, Отказ = Ложь) Экспорт
	Отказ = Истина;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	СтруктураОшибки = ИнтернетСервисыКлиентСервер.СтруктураError("");
	СтруктураОшибки.Вставить("code", 405);
	СтруктураОшибки.Вставить("allow", ДопустимыеМетоды);
	
	Ответ = Новый HTTPСервисОтвет(405,, Заголовки);
	Ответ.УстановитьТелоИзСтроки(ИнтернетСервисы.ПолучитьСтрокуJSON(СтруктураОшибки));
	
	ДополнитьОтветПараметрамиCORS(Ответ);
	Возврат Ответ;
КонецФункции

// 500 Internal Server Error — любая внутренняя ошибка сервера, которая не входит в
// рамки остальных ошибок класса.
Функция ПолучитьОтвет500(ТекстОшибки, Отказ = Ложь) Экспорт
	Отказ = Истина;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	СтруктураОшибки = ИнтернетСервисыКлиентСервер.СтруктураError(ТекстОшибки);
	СтруктураОшибки.Вставить("code", 500);
	
	Ответ = Новый HTTPСервисОтвет(500,, Заголовки);
	Ответ.УстановитьТелоИзСтроки(ИнтернетСервисы.ПолучитьСтрокуJSON(СтруктураОшибки));
	
	ДополнитьОтветПараметрамиCORS(Ответ);
	Возврат Ответ;
КонецФункции

// 501 Not Implemented — сервер не поддерживает возможностей, необходимых для обработки
// запроса. Типичный ответ для случаев, когда сервер не понимает указанный в запросе
// метод. Если же метод серверу известен, но он не применим к данному ресурсу, то
// нужно вернуть ответ 405.
Функция ПолучитьОтвет501(ТекстОшибки, Отказ = Ложь) Экспорт
	Отказ = Истина;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	СтруктураОшибки = ИнтернетСервисыКлиентСервер.СтруктураError(ТекстОшибки);
	СтруктураОшибки.Вставить("code", 501);
	
	Ответ = Новый HTTPСервисОтвет(501,, Заголовки);
	Ответ.УстановитьТелоИзСтроки(ИнтернетСервисы.ПолучитьСтрокуJSON(СтруктураОшибки));
	
	ДополнитьОтветПараметрамиCORS(Ответ);
	Возврат Ответ;
КонецФункции

Процедура ДополнитьОтветПараметрамиCORS(Ответ)
	
	ИнтернетСервисыПереопределяемый.ДополнитьОтветПараметрамиCORS(Ответ);
	
КонецПроцедуры

#КонецОбласти 

#Область УстаревшийИнтерфейс

// Устарела. Рекомендуется использовать ИнтернетСервисыКлиентСервер.ЗначениеВСтрокуJSON
Функция ПолучитьСтрокуJSON(знач ОбъектДанных) Экспорт
	Возврат ИнтернетСервисыКлиентСервер.ЗначениеВСтрокуJSON(ОбъектДанных);
КонецФункции

// Устарела. Рекомендуется использовать ИнтернетСервисыКлиентСервер.ЗначениеИзСтрокиJSON
Функция ЗначениеИзСтрокиJSON(знач СтрокаJSON) Экспорт
	Возврат ИнтернетСервисыКлиентСервер.ЗначениеИзСтрокиJSON(СтрокаJSON);
КонецФункции

// Устарела. Рекомендуется использовать ИнтернетСервисыКлиентСервер.ПроверитьHTTPСоединение
Функция ПроверитьHTTPСоединение(знач СоединениеHTTP, знач ВызыватьИсключение = Ложь, знач НеСообщать = Ложь) Экспорт
	Возврат ИнтернетСервисыКлиентСервер.ПроверитьHTTPСоединение(СоединениеHTTP, ВызыватьИсключение, НеСообщать);
КонецФункции

#КонецОбласти
